<?php
/*
 一等奖	●●●●●●	●	当奖池资金低于1亿元时，奖金总额为当期高等奖奖金的70%与奖池中累积的奖金之和，单注奖金按注均分，单注最高限额封顶500万元。
当奖池资金高于1亿元（含）时，奖金总额包括两部分，一部分为当期高等奖奖金的50%与奖池中累积的奖金之和，单注奖金按注均分，单注最高限额封顶500万元；另一部分为当期高等奖奖金的20%，单注奖金按注均分，单注最高限额封顶500万元。	选6+1中6+1
二等奖	●●●●●●	 	当期高等奖奖金的30%。	选6+1中6+0
三等奖	●●●●●	●	单注奖金额固定为3000元	选6+1中5+1
四等奖	●●●●●	 	单注奖金额固定为200元	选6+1中5+0或中4+1
●●●●	●
五等奖	●●●●	 	单注奖金额固定为10元	选6+1中4+0或中3+1
●●●	●
六等奖	●●	●	单注奖金额固定为5元	选6+1中2+1或中1+1或中0+1
 */
header('Content-Type:text/html;charset=utf-8');
/*
随机生成福彩双色球号码
*/
$red = range(0, 33);
//或者这样定义：$red = array(0,1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32,33);
unset($red[0]);//删除下标为0的第一个元素，因为rand取得是键名而不是键值
$blue = mt_rand(1, 16);//随机产生的蓝色的球号
$red_6 = array_rand($red, 6);//取出六个红色球
?>
<div style="background-color:red;color:white;width:160px;float:left;text-align:center;">
    <?php
    foreach ($red_6 as $v) {
        echo "$v ";
}
    ?>
</div>
<div style="background-color:blue;color:white;width:40px;float:left;text-align:center">
    <?php
    echo "$blue";
    ?>
</div>